[
    {
        "id": 1,
        "idCategory": 1,
        "name": "Full Stack Developer Career",
        "type" : "Career",
        "technologies": "HTML/CSS/JavaScript/React/MongoDB/MySQL",
        "teacher": "Lautaro Lopez",
        "description": "Looking to become a full stack developer? Our comprehensive course covers all the essential technologies and tools you need to know to build web applications from start to finish. You'll learn how to design and develop user interfaces with HTML, CSS, and JavaScript, build server-side applications with Node.js and Express, work with databases using SQL and MongoDB With hands-on projects and real-world examples, you'll gain the practical experience you need to jumpstart your career as a full stack deveCareerloper.",
        "hours": 400,
        "price": 170000,
        "stock": 12,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/fullstack.webp?alt=media&token=cfc6ebbc-452d-4aa2-abdb-40cc2925ea94"
    },
    {
        "id": 2,
        "idCategory": 1,
        "name": "Frontend Developer Career",
        "type" : "Career",
        "technologies": "HTML/CSS/JavaScript/React",
        "teacher": "Stevie Barton",
        "description": "You'll learn how to work with HTML, CSS, and JavaScript, as well as popular frontend frameworks as React. We'll also cover advanced topics like web accessibility, web performance optimization, and component-based architecture, giving you the skills and knowledge you need to build web applications that are fast, reliable, and user-friendly.",
        "hours": 100,
        "price": 45000,
        "stock": 20,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/frontend.webp?alt=media&token=9e0c2d64-ea48-455c-a05c-4f5dba8f5199"
    },
    {
        "id": 3,
        "idCategory": 1,
        "name": "Backend Developer Career",
        "type" : "Career",
        "technologies": "Node.JS,Express,MongoDB,SQL,NoSQL",
        "teacher": "Fransisco Pugh",
        "description": "Starting with the basics of backend development, you'll learn how to work with databases, create RESTful APIs, and manage server-side applications using Node.js, Express, and MongoDB. You'll also explore advanced topics such as cloud computing, security, and DevOps, giving you a well-rounded understanding of the entire backend development process.",
        "hours": 150,
        "price": 55000,
        "stock": 26,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/backend.webp?alt=media&token=f4ca0c4f-ef4a-4b5f-8115-cb122dec1e4f"
    },
    {
        "id": 4,
        "idCategory": 1,
        "name": "Q.A Developer Career",
        "type" : "Career",
        "technologies": "Selenium/Appium/TestComplete/Postman/SoapUI",
        "teacher": "Andrew Austin",
        "description": "Are you interested in becoming a QA Tester? Our comprehensive course is designed to equip you with the latest tools and techniques to test software applications effectively. With our experienced instructors, you'll learn the fundamentals of software testing, including test planning, test case design, and defect tracking. You'll also gain hands-on experience using industry-standard testing tools and technologies, including JIRA, Selenium, and Appium.",
        "hours": "230",
        "price": 50000,
        "stock": 15,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/qa.webp?alt=media&token=93353882-ffd5-49a3-aa05-277c44ab0197"
    },
    {
        "id": 5,
        "idCategory": 1,
        "name": "DevOps Course",
        "type" : "Course",
        "technologies": 1,
        "teacher": "Oliver Hensley",
        "description": "Throughout the course, you'll work on real-world projects and use technologies such as Git and GitHub for version control and collaboration, Jenkins for continuous integration and deployment, Docker and Kubernetes for containerization and orchestration, Ansible for infrastructure automation, AWS (Amazon Web Services) for cloud computing and deployment, and ELK stack for log analysis and monitoring. In addition to these technologies, you'll also learn about other important concepts such as Agile development methodologies, configuration management, and testing and monitoring tools.",
        "hours": 110,
        "price": 65000,
        "stock": 33,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/devops.webp?alt=media&token=c3760335-6559-448f-9396-0f5464a53568"
    },
    {
        "id": 6,
        "idCategory": 1,
        "name": "Pyhton Course",
        "type" : "Course",
        "technologies": "Basic to Intermediate Level",
        "teacher": "Wally Allen",
        "description": "Our Python course is designed to provide you with a comprehensive understanding of the Python programming language and its various applications. You'll learn the basics of Python syntax and data structures, and progress to more advanced topics such as object-oriented programming, web development, and data science.Throughout the course, you'll work on real-world projects and learn how to use popular Python libraries and frameworks such as NumPy, Pandas, Flask, and Django. You'll also gain experience with web scraping, data analysis, and visualization using Python tools.",
        "hours": 55,
        "price": 15000,
        "stock": 44,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/python.webp?alt=media&token=0074a421-e9e3-441b-af77-ace4bc8d73a0"
    },
    {
        "id": 7,
        "idCategory": 1,
        "name": "I.A Developer Career",
        "type" : "Career",
        "technologies": "Python/TensorFlow/Keras/PyTorch",
        "teacher": "Joe Williams",
        "description": "Our AI course is designed to provide you with a comprehensive understanding of the field of artificial intelligence and its various applications. You'll learn about the different types of AI, including supervised and unsupervised learning, deep learning, and neural networks. Throughout the course, you'll work on real-world projects and learn how to use popular AI libraries and frameworks such as TensorFlow, Keras, and PyTorch. You'll also gain experience with natural language processing (NLP), computer vision, and machine learning algorithms.",
        "hours": 430,
        "price": 60000,
        "stock": 20,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/ia.webp?alt=media&token=f8d340e1-ff29-4285-a357-71ae77ef7dd5"
    },
    {
        "id": 8,
        "idCategory": 1,
        "name": "C++ Course",
        "type" : "Course",
        "technologies": "C++",
        "teacher": "Jack Prett",
        "description": "Our C++ course is designed to provide you with a comprehensive understanding of the C++ programming language, including its syntax, data types, and control structures. You'll learn how to use C++ to write efficient and scalable code for a wide range of applications, from desktop software to high-performance computing.Our experienced instructors will provide personalized feedback and support throughout the course, helping you gain the practical experience you need to succeed as a C++ developer. Whether you're a beginner or an experienced programmer, our C++ course is the perfect way to take your skills to the next level and advance your career in software development. ",
        "hours": 34,
        "price": "15000",
        "stock": 50,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/c%2B%2B.webp?alt=media&token=1f00d955-cc38-4fa3-b3e9-776ec6fc4e79"
    },
    {
        "id": 9,
        "idCategory": 1,
        "name": "JavaScript Course",
        "type" : "Course",
        "technologies": "JQuery/Libraries",
        "teacher": "Anna Miller",
        "description": "Our JavaScript course covers a wide range of technologies used in web development, including popular frameworks and libraries such as React, Node.js, and jQuery. You'll also learn fundamental concepts like variables, data types, functions, control flow, and object-oriented programming (OOP). You'll work on real-world projects that will help you gain hands-on experience with these technologies and develop your skills as a JavaScript developer. Our experienced instructors will provide personalized feedback and support to ensure you have the practical experience you need to succeed in the field.",
        "hours": 40,
        "price": 15000,
        "stock": 68,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/javascript.webp?alt=media&token=7dd7accb-231f-4f62-b0ba-17f02fd7cfa1"
    },
    {
        "id": 10,
        "idCategory": 1,
        "name": "React Course",
        "type" : "Course",
        "technologies": "React , Hooks , Forms , States",
        "teacher": "Chris Mardon",
        "description": "Looking to master React and build powerful front-end applications? Our comprehensive React course covers all the essential concepts and techniques you need to know, from the basics of components, props, and state to more advanced topics like routing and data management.Our experienced instructors will guide you through a series of hands-on projects and exercises that will help you develop your skills and build your portfolio as a React developer. By the end of the course, you'll have a strong foundation in React and be well-equipped to build complex web applications with confidence.",
        "hours": 40,
        "price": 15000,
        "stock": 12,
        "img": "https://firebasestorage.googleapis.com/v0/b/react-39530-2023-7e7e0.appspot.com/o/react.webp?alt=media&token=1a52dd92-584d-4368-a9ba-d6c819447a72"
    }    
]